---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeShowAngularDimensionsFor
source: html/6136b837-1637-6c44-6af3-965abc1257a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeShowAngularDimensionsFor Property

"Show for Angles"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeShowAngularDimensionsFor { get; }
```